app/Http/Controllers/API/V1/LineController.php

    public function index(Request $request)
    {

        ## Read value
        $draw = $request->get('draw');
        $start = $request->get("start");
        $length = $request->get("length"); // Rows display per page

        $order = $request->get('order');
        $columns = $request->get('columns');
        $search = $request->get('search');
        $columnIndex = $order[0]['column']; // Column index
        $columnName = $columns[$columnIndex]['data']; // Column name
        $columnSortOrder = $order[0]['dir']; // asc or desc
        $searchValue = $search['value']; // Search value

        $totalRecords = Line::select('count(*) as allcount')->count();   // Total records
        $iTotalDisplayRecords = Line::select('count(*) as allcount')->search($searchValue)->count();
---
select count(*) as aggregate from "lines"