app/Http/Controllers/API/V1/ProductController.php

    public function index(Request $request)
    {

        ## Read value
        $draw = $request->get('draw');
        $start = $request->get("start");
        $length = $request->get("length"); // Rows display per page

        $order = $request->get('order');
        $columns = $request->get('columns');
        $search = $request->get('search');
        //dd($request->get('category'));
        $columnIndex = $order[0]['column']; // Column index
        $columnName = $columns[$columnIndex]['data']; // Column name
        $columnSortOrder = $order[0]['dir']; // asc or desc
        $searchValue = $search['value']; // Search value

        $totalRecords = Product::select('count(*) as allcount')->count();   // Total records
        $iTotalDisplayRecords = Product::select('count(*) as allcount')->search($searchValue)->count();

        // Fetch records
        $records = Product::with('category')
            ->search($searchValue)
            ->orderBy($columnName, $columnSortOrder)
            ->skip($start)
            ->take($length)
            ->get();
---
select count(*) as aggregate from "products" where "products"."deleted_at" is null
select * from "categories" where "categories"."id" in ('180d4d29-8557-4004-9220-bdcb89edd550', '9894719e-ce5a-42c8-9b87-b22d58088f9d', 'e358804a-4f66-4144-a44f-2a33264bdfc1', 'e59d94fc-ff05-41ad-b960-68ec17782ddd', 'e6732507-994e-4c0b-af13-33d36cc8c235')
select * from "products" where "products"."deleted_at" is null order by "name" asc limit 10 offset 0