app/Http/Controllers/API/V1/SalesmanController.php

select "id", "root_name" from "roots"
select "id", "location" from "lines"
---
    public function getSalesmen(): JsonResponse
    {
        // Fetch only the 'id' and 'name' fields from the Salesman model
        $salesmen = Salesman::select('id', 'salesman_name')->get();
        $roots = Root::select('id', 'root_name')->get();
        $lines = Line::select('id', 'location')->get();