app/Http/Controllers/ProductController.php

    public function index(Request $request)
    {
        $hasExchangeRate = config('settings')->enableExchangeRateForItems;
        $exchangeRate = config('settings')->exchangeRate;
        $products = Product::all();
        $sum_cost = Product::sum(DB::raw('cost * in_stock'));
        $sum_unit_price = Product::sum('unit_price');
        $sum_box_price = Product::sum('box_price');

        $total_whole_cost = 0;
        $total_whole_unit_price = 0;
        $total_whole_box_price = 0;
        foreach ($products as $p) {
            $total_whole_cost += $p->cost * $p->in_stock;
            $total_whole_unit_price += $p->unit_price * $p->in_stock;
            $total_whole_box_price += $p->box_price * $p->in_stock / 10;
        }


        $this->data['categories'] = Category::orderBy('sort_order', 'ASC')->get();
        $this->data['total_cost'] = currency_format($sum_cost);
        $this->data['total_whole_cost'] = currency_format($total_whole_cost, $hasExchangeRate).' ('.currency_format($sum_cost).')';
        $this->data['total_unit_price'] = currency_format($sum_unit_price);
        $this->data['total_whole_unit_price'] = currency_format($total_whole_unit_price, $hasExchangeRate).' ('.currency_format($total_whole_unit_price).')';
        $this->data['total_box_price'] = currency_format($sum_box_price, $hasExchangeRate).' ('.currency_format($sum_box_price).')';
        $this->data['total_whole_box_price'] = currency_format($total_whole_box_price, $hasExchangeRate).' ('.currency_format($total_whole_box_price).')';
        $this->data['total_in_stock'] = Product::sum('in_stock');
---
select * from "products" where "products"."deleted_at" is null
select sum(cost * in_stock) as aggregate from "products" where "products"."deleted_at" is null
select sum("unit_price") as aggregate from "products" where "products"."deleted_at" is null
select sum("box_price") as aggregate from "products" where "products"."deleted_at" is null
select * from "categories" where "categories"."deleted_at" is null order by "sort_order" asc
select sum("in_stock") as aggregate from "products" where "products"."deleted_at" is null

    public function create(): View
    {

        return view("products.create", [
            'categories' => Category::orderBy('sort_order', 'ASC')->get(),
        ]);
---
select * from "categories" where "categories"."deleted_at" is null order by "sort_order" asc

    public function edit(Product $product): View
    {
        $dns1d = new DNS1D(); // Create an instance of the DNS1D class
        $dns1d->setStorPath(__DIR__ . '/cache/');
        $barcodeHTML = 'data:image/png;base64,' . $dns1d->getBarcodePNG($product->barcode, 'C128');

        return view("products.edit", [
            'product' => $product,
            'barcode' => $barcodeHTML,
            'categories' => Category::orderBy('sort_order', 'ASC')->get(),
---
select * from "categories" where "categories"."deleted_at" is null order by "sort_order" asc