app/Models/Settings.php

select * from "settings" where "settings"."id" = 15 limit 1
---
    public static function getValue(int $id)
    {
        return Settings::find($id)->value;